org-html/Data-structure.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-11-20 二 23:34 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>数据结构</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="hiro" />
<link rel="stylesheet" type="text/css" href="/home/hiro/Documents/org-files/worg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">数据结构</h1>

<div id="outline-container-org796bcf4" class="outline-2">
<h2 id="org796bcf4"><span class="section-number-2">1</span> 基础知识点</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>数据元素 数据项 学生记录是一个数据元素，一个学生记录由多个数据项组成</li>
<li>数据类型有：原子类型、结构类型、抽象数据类型（数据对象、数据关系、基本操作）</li>
<li>数据结构有：逻辑结构、存储结构、数据的运算</li>
<li>逻辑结构：线性结构（栈、广义表等）、非线性结构（集合、树形、网状）</li>
<li>存储结构：顺序存储（随机存取）、链式存储（顺序存取）、索引存储（随机）、散列存储（随机，有冲突）</li>
<li>易错点：循环队列是用顺序表（顺序存储结构的单链表）表示的队列；栈是一种逻辑结构，可以使用顺序存储或者链式存储实现</li>
<li>\(T(n) = T_1(n) + T_2(n) = O(max(f(n),g(n)))\)</li>
<li>\(T(n) = T_1(n) * T_2(n) = O(f(n)*g(n))\)</li>
</ul>
</div>
</div>
<div id="outline-container-org721f110" class="outline-2">
<h2 id="org721f110"><span class="section-number-2">2</span> 线性表（逻辑结构）</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>顺序表：线性表的顺序存储</li>
<li>单链表：线性表的链式存储（非随机存取）</li>
<li>引入头结点的优点：无需对第一个结点进行特殊处理</li>
<li>双链表：既有next又有prior</li>
<li>循环单链表：单链表尾指针指向头结点</li>
<li>循环双链表</li>
<li>静态链表：以next=-1作为结束的标志；顺序存储，顺序存取；插入删除和其他链表一样，不移动元素，只修改指针</li>
<li>当顺序表无序，时间复杂度O(n)；顺序表有序时，时间复杂度O(log(n))</li>
<li>建立一个有序链表的最小时间复杂度是O(nlog(n))</li>
</ul>
</div>
</div>
<div id="outline-container-orgbf9725c" class="outline-2">
<h2 id="orgbf9725c"><span class="section-number-2">3</span> 栈（逻辑结构）</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>只能一端插入、删除的线性表</li>
<li>共享栈 为了有效的利用存储空间，让两个栈共享一个存储空间；对存储效率没有影响</li>
<li>易错点：注意开始时候栈顶元素的位置</li>
<li>技巧 对于n个元素进栈，出栈序列为 \(\frac{1}{n+1} C_{2n}^n\)</li>
<li>易错点：C语言中标识符的规定 第一个字符必须是大小写英文字母或者下划线，不能是数字</li>
<li>中缀表达式（对应中序遍历，左中右）</li>
<li>栈的应用 进制转换、迷宫求解、递归</li>
</ul>
</div>
</div>
<div id="outline-container-org69eb004" class="outline-2">
<h2 id="org69eb004"><span class="section-number-2">4</span> 队列</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li>只允许在表的一端插入，另一端删除</li>
<li>队列操作 rear 进，front 出（rear 中不存放元素）
<ul class="org-ul">
<li>初始条件 Q.front = Q.rear = 0</li>
<li>进队操作 SqQueue[Q.rear] = x; Q.rear ++;</li>
<li>出队操作 x = SqQueue[Q.front]; Q.front ++;</li>
</ul></li>
<li>循环队列操作
<ul class="org-ul">
<li>初始条件 Q.front = Q.rear = 0</li>
<li>进队操作 SqQueue[Q.rear] = x; Q.rear = (Q.rear+1)%MaxSize</li>
<li>出队操作 x = SqQueue[Q.front]; Q.front = (Q.front+1)%MaxSize</li>
<li>队列长度 (Q.rear+MaxSize-Q.front)%MaxSize</li>
<li>队空条件 Q.front = Q.rear</li>
</ul></li>
<li>队满条件
<ul class="org-ul">
<li>牺牲一个单元（rear所在的单元不放元素） (Q.rear+1)%MaxSize = Q.front</li>
<li>增设表示元素个数的数据成员 Q.size = MaxSize</li>
<li>增设 tag 表示是否队满</li>
</ul></li>
<li>能由输入受限的双端队列得到而不能由输出受限的双端队列得到的是 4,1,3,2</li>
<li>能由输出受限的双端队列得到而不能由输入受限的双端队列得到的是 4,2,1,3</li>
<li>既不能由输出受限的双端队列得到也不能由输入受限的双端队列得到的是 4,2,3,1</li>
<li>易错点：用链表形式存储队列时，一般情况下，删除操作只需要修改头指针即可；但如果队列中只有一个元素，删除后队列为空，需要修改尾指针Q.rear=Q.front</li>
<li>队列的应用 缓存区</li>
</ul>
</div>
</div>
<div id="outline-container-orgf5a6b50" class="outline-2">
<h2 id="orgf5a6b50"><span class="section-number-2">5</span> 树与二叉树</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li>结点的度 一个结点的子结点的个数</li>
<li>树的度 一棵树中结点的最大度数</li>
<li>结点的层次 从根结点开始为第一层</li>
<li>结点的高度 从根结点开始自低向上增加</li>
<li>结点的深度 从根结点开始自上向下增加</li>
<li>树的高度（深度） 从1开始</li>
<li>路径长度 路径上经过的边的个数</li>
<li>树的路径长度 所有路径长度的总和</li>
<li>易错点 度为2的树至少有三个结点；而二叉树可以为空；二叉树区分左右子树</li>
<li>二叉树的性质 \(N_0 + N_1 + N_2 = 2N_2 + N_1 + 1 => N_0 = N_2 + 1\)</li>
<li>具有n个结点的 <b>完全</b> 二叉树的高度为 \(log_2N +1\)</li>
<li>二叉树中不可能存在奇数个的度为1的结点</li>
<li>由二叉树的中序和先序、后序、层次遍历可以唯一的确定一颗二叉树</li>
<li>线索二叉树是加上线索的链表结构，他是一种物理结构</li>
<li>先序二叉树中查找前驱需要知道结点的双亲；后序二叉树中查找后继也需要知道结点的双亲</li>
<li>树的存储结构
<ul class="org-ul">
<li>双亲表示法 静态链表，有一个单元存储双亲的位置</li>
<li>孩子表示法 每个结点一个链表，链表中有结点的孩子结点</li>
<li>孩子兄弟表示法 每个结点包含结点值，指向结点第一个孩子结点的指针，指向结点下一个兄弟结点的指针</li>
</ul></li>
<li>易错点 树的后根遍历相当于二叉树的中序遍历（左根右）</li>
<li>二叉排序树的删除操作
<ul class="org-ul">
<li>叶结点 直接删除</li>
<li>只有一颗左子树或者右子树，使用右子树或者左子树替代</li>
<li>有左和右子树，找右子树最左边的或者左子树最右边的替代</li>
</ul></li>
<li>平衡二叉树的插入
<ul class="org-ul">
<li>每次调整的对象都是最小不平衡子树</li>
<li>\(N_h\)表示深度为h的平衡树中含有的最小结点数，\(N_h = N_{h-1} + N_{h-2} + 1, N_0 = 0, N_1 = 1, N_2 = 2\)</li>
<li>含有n个结点的平衡二叉树的最大深度是 \(log_2n\)</li>
<li>平均查找长度 \(log_2n\)</li>
</ul></li>
<li>非前缀编码 任何一个编码都不是其他编码的前缀</li>
</ul>
</div>
</div>

<div id="outline-container-org6c7df62" class="outline-2">
<h2 id="org6c7df62"><span class="section-number-2">6</span> 伪代码（C）</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-org3482efe" class="outline-3">
<h3 id="org3482efe"><span class="section-number-3">6.1</span> 代码常识</h3>
<div class="outline-text-3" id="text-6-1">
<ul class="org-ul">
<li>指针 存储数据所在位置，地址</li>
<li>引用 数据</li>
</ul>
</div>
</div>
<div id="outline-container-orga46ec1a" class="outline-3">
<h3 id="orga46ec1a"><span class="section-number-3">6.2</span> 线性表</h3>
<div class="outline-text-3" id="text-6-2">
<ul class="org-ul">
<li>线性表中的元素是从1开始的，而数组中的顺序是从0开始的</li>
<li><p>
线性表的顺序存储类型表述（数组定义）（静态分配）
</p>
<div class="org-src-container">
<pre class="src src-c"><span style="color: #cc99cc;">#define</span> <span style="color: #ffcc66;">MaxSize</span> 50
<span style="color: #99cc99;">typedef</span> <span style="color: #99cc99;">struct</span> <span style="color: #cccccc;">{</span>
  <span style="color: #6699cc;">ElemType</span> <span style="color: #ffcc66;">data</span><span style="color: #66cccc;">[</span>MaxSize<span style="color: #66cccc;">]</span>;
  <span style="color: #6699cc;">int</span> <span style="color: #ffcc66;">length</span>;
<span style="color: #cccccc;">}</span> <span style="color: #6699cc;">SqList</span>;
</pre>
</div></li>
<li><p>
线性表的顺序存储类型表述（数组定义）（动态分配）
</p>
<div class="org-src-container">
<pre class="src src-c"><span style="color: #cc99cc;">#define</span> <span style="color: #ffcc66;">InitSize</span> 20
<span style="color: #99cc99;">typedef</span> <span style="color: #99cc99;">struct</span> <span style="color: #cccccc;">{</span>
  <span style="color: #999999; font-style: italic;">// </span><span style="color: #999999; font-style: italic;">&#25351;&#38024;</span>
  <span style="color: #6699cc;">ElemType</span> *<span style="color: #ffcc66;">data</span>;
  <span style="color: #6699cc;">int</span> <span style="color: #ffcc66;">MaxSize</span>, <span style="color: #ffcc66;">length</span>;
<span style="color: #cccccc;">}</span> <span style="color: #6699cc;">SeqList</span>;
<span style="color: #999999; font-style: italic;">// </span><span style="color: #999999; font-style: italic;">&#21160;&#24577;&#20998;&#37197;</span>
L.data = <span style="color: #cccccc;">(</span><span style="color: #6699cc;">ElemType</span><span style="color: #cccccc;">)</span> malloc<span style="color: #cccccc;">(</span><span style="color: #99cc99;">sizeof</span><span style="color: #66cccc;">(</span>ElemType<span style="color: #66cccc;">)</span> *InitSize<span style="color: #cccccc;">)</span>;
<span style="color: #999999; font-style: italic;">// </span><span style="color: #999999; font-style: italic;">C++ &#21160;&#24577;&#20998;&#37197;</span>
L.data = new ElemType<span style="color: #cccccc;">[</span>InitSize<span style="color: #cccccc;">]</span>
</pre>
</div></li>
<li><p>
顺序表的插入
</p>
<div class="org-src-container">
<pre class="src src-C"><span style="color: #6699cc;">bool</span> <span style="color: #f99157;">ListInsert</span><span style="color: #cccccc;">(</span>SqList &amp;L, <span style="color: #6699cc;">int</span> <span style="color: #ffcc66;">i</span>, <span style="color: #6699cc;">ElemType</span> <span style="color: #ffcc66;">e</span><span style="color: #cccccc;">)</span> <span style="color: #cccccc;">{</span>
  <span style="color: #999999; font-style: italic;">// </span><span style="color: #999999; font-style: italic;">&#23558;&#20803;&#32032;e&#25554;&#20837;&#21040;L&#30340;&#31532;i&#20010;&#20301;&#32622;&#65307;i&#20174;1&#24320;&#22987;</span>
  <span style="color: #99cc99;">if</span> <span style="color: #66cccc;">(</span>i &lt; 1 || i &gt; L.length + 1<span style="color: #66cccc;">)</span>
    <span style="color: #99cc99;">return</span> <span style="color: #6699cc;">false</span>;
  <span style="color: #99cc99;">if</span> <span style="color: #66cccc;">(</span>L.length &gt;= MaxSize<span style="color: #66cccc;">)</span>
    <span style="color: #99cc99;">return</span> <span style="color: #6699cc;">false</span>;
  <span style="color: #999999; font-style: italic;">// </span><span style="color: #999999; font-style: italic;">&#21518;&#31227;</span>
  <span style="color: #99cc99;">for</span> <span style="color: #66cccc;">(</span><span style="color: #6699cc;">int</span> <span style="color: #ffcc66;">j</span>=L.length; j&gt;=i; j--<span style="color: #66cccc;">)</span> <span style="color: #66cccc;">{</span>
    L.data<span style="color: #ffcc66;">[</span>j<span style="color: #ffcc66;">]</span> = L.data<span style="color: #ffcc66;">[</span>j-1<span style="color: #ffcc66;">]</span>;
  <span style="color: #66cccc;">}</span>
  L.data<span style="color: #66cccc;">[</span>i-1<span style="color: #66cccc;">]</span> = e;
  L.length ++;
  <span style="color: #99cc99;">return</span> <span style="color: #6699cc;">true</span>;
<span style="color: #cccccc;">}</span>
</pre>
</div></li>
<li><p>
顺序表的删除
</p>
<div class="org-src-container">
<pre class="src src-C"><span style="color: #6699cc;">bool</span> <span style="color: #f99157;">ListDelete</span><span style="color: #cccccc;">(</span>SqList &amp;L, <span style="color: #6699cc;">int</span> <span style="color: #ffcc66;">i</span>, ElemType &amp;e<span style="color: #cccccc;">)</span> <span style="color: #cccccc;">{</span>
  <span style="color: #999999; font-style: italic;">// </span><span style="color: #999999; font-style: italic;">&#23558;L&#20013;&#31532;i&#20010;&#20803;&#32032;&#21024;&#38500;&#65292;&#36171;&#20540;&#32473;e</span>
  <span style="color: #99cc99;">if</span> <span style="color: #66cccc;">(</span>i &lt; 1 || i &gt; L.length<span style="color: #66cccc;">)</span>
    <span style="color: #99cc99;">return</span> <span style="color: #6699cc;">false</span>;
  e = L.data<span style="color: #66cccc;">[</span>i-1<span style="color: #66cccc;">]</span>;
  <span style="color: #999999; font-style: italic;">// </span><span style="color: #999999; font-style: italic;">&#21069;&#31227;</span>
  <span style="color: #99cc99;">for</span> <span style="color: #66cccc;">(</span><span style="color: #6699cc;">int</span> <span style="color: #ffcc66;">j</span>=i; j&lt;L.length; j++<span style="color: #66cccc;">)</span>
    L.data<span style="color: #66cccc;">[</span>j-1<span style="color: #66cccc;">]</span> = L.data<span style="color: #66cccc;">[</span>j<span style="color: #66cccc;">]</span>;
  L.length --;
  <span style="color: #99cc99;">return</span> <span style="color: #6699cc;">false</span>;
<span style="color: #cccccc;">}</span>
</pre>
</div></li>
</ul>
</div>
</div>
