Data_Structure.org
** 单链表
- 结点定义
  #+BEGIN_SRC C
    typedef struct LNode {
      ElemType data;
      struct LNode *next;
    } LNode, *LinkedList;
  #+END_SRC
- 头插法
  #+BEGIN_SRC C
    LinkedList createList1(LinkList &L) {
      // 带头结点的单链表
      LNode *s; int x;
      L = (LinkedList)malloc(sizeof(LNode));
      L -> next = null;
      scanf("%d", &x);
      while (x != 9999) {
        s = (LNode*)malloc(sizeof(LNode));
        s -> data = x;
        s -> next = L -> next;
        L -> next = s;
        scanf("%d", &x);
      }
      return L;
    }
  #+END_SRC
- 尾插法
  #+BEGIN_SRC C
    LinkedList createList2(LinkedList &L) {
      int x;
      // malloc 分配出来的是指针类型
      L = (LinkedList)malloc(sizeof(LNode));
      LNode *s, *r = L;
      scanf("%s", x);
      while(x != 9999) {
        s = (LNode*)malloc(sizeof(LNode));
        s -> data = x;
        r -> next = s;
        r = s;
        scanf("%d", x);
      }
      r -> next = NULL;
      return r;
    }
  #+END_SRC
- 双链表
  #+BEGIN_SRC C
    typedef struct DNode {
      ElemType data;
      Struct DNode *prior, *next;
    } DNode, *DLinkList;
  #+END_SRC
- 静态链表
  #+BEGIN_SRC C
    #define MaxSize 50
    typedef struct {
      ElemType data;
      int next;
    } SLinkList[MaxSize];
  #+END_SRC
** 栈
- 顺序栈（顺序存储）
  #+BEGIN_SRC C
    #define MaxSize 50
    typedef struct {
      ElemType data;
      int top;
    } SqStack;
  #+END_SRC
** 队列
- 顺序队列
  #+BEGIN_SRC C
    #define MaxSize 50
    typedef struct {
      ElemType data;
      int front, rear;
    } SqQueue;
  #+END_SRC
