org-html/Data-structure.html
<div id="outline-container-org6a03fbd" class="outline-3">
<h3 id="org6a03fbd"><span class="section-number-3">6.3</span> 单链表</h3>
<div class="outline-text-3" id="text-6-3">
<ul class="org-ul">
<li><p>
结点定义
</p>
<div class="org-src-container">
<pre class="src src-C"><span style="color: #99cc99;">typedef</span> <span style="color: #99cc99;">struct</span> <span style="color: #6699cc;">LNode</span> <span style="color: #cccccc;">{</span>
  <span style="color: #6699cc;">ElemType</span> <span style="color: #ffcc66;">data</span>;
  <span style="color: #99cc99;">struct</span> <span style="color: #6699cc;">LNode</span> *<span style="color: #ffcc66;">next</span>;
<span style="color: #cccccc;">}</span> <span style="color: #6699cc;">LNode</span>, *<span style="color: #6699cc;">LinkedList</span>;
</pre>
</div></li>
<li><p>
头插法
</p>
<div class="org-src-container">
<pre class="src src-C"><span style="color: #6699cc;">LinkedList</span> <span style="color: #f99157;">createList1</span><span style="color: #cccccc;">(</span>LinkList &amp;L<span style="color: #cccccc;">)</span> <span style="color: #cccccc;">{</span>
  <span style="color: #999999; font-style: italic;">// </span><span style="color: #999999; font-style: italic;">&#24102;&#22836;&#32467;&#28857;&#30340;&#21333;&#38142;&#34920;</span>
  <span style="color: #6699cc;">LNode</span> *<span style="color: #ffcc66;">s</span>; <span style="color: #6699cc;">int</span> <span style="color: #ffcc66;">x</span>;
  L = <span style="color: #66cccc;">(</span><span style="color: #6699cc;">LinkedList</span><span style="color: #66cccc;">)</span>malloc<span style="color: #66cccc;">(</span><span style="color: #99cc99;">sizeof</span><span style="color: #ffcc66;">(</span>LNode<span style="color: #ffcc66;">)</span><span style="color: #66cccc;">)</span>;
  L -&gt; next = null;
  scanf<span style="color: #66cccc;">(</span><span style="color: #66cccc;">"%d"</span>, &amp;x<span style="color: #66cccc;">)</span>;
  <span style="color: #99cc99;">while</span> <span style="color: #66cccc;">(</span>x != 9999<span style="color: #66cccc;">)</span> <span style="color: #66cccc;">{</span>
    s = <span style="color: #ffcc66;">(</span><span style="color: #6699cc;">LNode</span>*<span style="color: #ffcc66;">)</span>malloc<span style="color: #ffcc66;">(</span><span style="color: #99cc99;">sizeof</span><span style="color: #99cc99;">(</span>LNode<span style="color: #99cc99;">)</span><span style="color: #ffcc66;">)</span>;
    s -&gt; data = x;
    s -&gt; next = L -&gt; next;
    L -&gt; next = s;
    scanf<span style="color: #ffcc66;">(</span><span style="color: #66cccc;">"%d"</span>, &amp;x<span style="color: #ffcc66;">)</span>;
  <span style="color: #66cccc;">}</span>
  <span style="color: #99cc99;">return</span> L;
<span style="color: #cccccc;">}</span>
</pre>
</div></li>
<li><p>
尾插法
</p>
<div class="org-src-container">
<pre class="src src-C"><span style="color: #6699cc;">LinkedList</span> <span style="color: #f99157;">createList2</span><span style="color: #cccccc;">(</span>LinkedList &amp;L<span style="color: #cccccc;">)</span> <span style="color: #cccccc;">{</span>
  <span style="color: #6699cc;">int</span> <span style="color: #ffcc66;">x</span>;
  <span style="color: #999999; font-style: italic;">// </span><span style="color: #999999; font-style: italic;">malloc &#20998;&#37197;&#20986;&#26469;&#30340;&#26159;&#25351;&#38024;&#31867;&#22411;</span>
  L = <span style="color: #66cccc;">(</span><span style="color: #6699cc;">LinkedList</span><span style="color: #66cccc;">)</span>malloc<span style="color: #66cccc;">(</span><span style="color: #99cc99;">sizeof</span><span style="color: #ffcc66;">(</span>LNode<span style="color: #ffcc66;">)</span><span style="color: #66cccc;">)</span>;
  <span style="color: #6699cc;">LNode</span> *<span style="color: #ffcc66;">s</span>, *<span style="color: #ffcc66;">r</span> = L;
  scanf<span style="color: #66cccc;">(</span><span style="color: #66cccc;">"%s"</span>, x<span style="color: #66cccc;">)</span>;
  <span style="color: #99cc99;">while</span><span style="color: #66cccc;">(</span>x != 9999<span style="color: #66cccc;">)</span> <span style="color: #66cccc;">{</span>
    s = <span style="color: #ffcc66;">(</span><span style="color: #6699cc;">LNode</span>*<span style="color: #ffcc66;">)</span>malloc<span style="color: #ffcc66;">(</span><span style="color: #99cc99;">sizeof</span><span style="color: #99cc99;">(</span>LNode<span style="color: #99cc99;">)</span><span style="color: #ffcc66;">)</span>;
    s -&gt; data = x;
    r -&gt; next = s;
    r = s;
    scanf<span style="color: #ffcc66;">(</span><span style="color: #66cccc;">"%d"</span>, x<span style="color: #ffcc66;">)</span>;
  <span style="color: #66cccc;">}</span>
  r -&gt; next = <span style="color: #6699cc;">NULL</span>;
  <span style="color: #99cc99;">return</span> r;
<span style="color: #cccccc;">}</span>
</pre>
</div></li>
<li><p>
双链表
</p>
<div class="org-src-container">
<pre class="src src-C"><span style="color: #99cc99;">typedef</span> <span style="color: #99cc99;">struct</span> <span style="color: #6699cc;">DNode</span> <span style="color: #cccccc;">{</span>
  <span style="color: #6699cc;">ElemType</span> <span style="color: #ffcc66;">data</span>;
  Struct <span style="color: #6699cc;">DNode</span> *<span style="color: #ffcc66;">prior</span>, *<span style="color: #ffcc66;">next</span>;
<span style="color: #cccccc;">}</span> <span style="color: #6699cc;">DNode</span>, *<span style="color: #6699cc;">DLinkList</span>;
</pre>
</div></li>
<li><p>
静态链表
</p>
<div class="org-src-container">
<pre class="src src-C"><span style="color: #cc99cc;">#define</span> <span style="color: #ffcc66;">MaxSize</span> 50
<span style="color: #99cc99;">typedef</span> <span style="color: #99cc99;">struct</span> <span style="color: #cccccc;">{</span>
  <span style="color: #6699cc;">ElemType</span> <span style="color: #ffcc66;">data</span>;
  <span style="color: #6699cc;">int</span> <span style="color: #ffcc66;">next</span>;
<span style="color: #cccccc;">}</span> <span style="color: #6699cc;">SLinkList</span><span style="color: #cccccc;">[</span>MaxSize<span style="color: #cccccc;">]</span>;
</pre>
</div></li>
</ul>
</div>
</div>
